const parablesArray = [
	{
		title: 'Будда та астролог',
		html: `<p class="desc-item__text">Якось ішов собі Будда від одного села до іншого. Надворі припікало сонечко, тому мудрець роззувся й подався берегом босоніж. Оскільки пісок був мокрий, на ньому Залишалися чіткі сліди стоп.<br><br> Водночас тією самою дорогою чимчикував астролог, що повертався додому після п’ятнадцятирічного навчання. Побачивши на піску сліди, він не повірив своїм очам – адже зірки колись показали, що так мають виглядати сліди величного царя, який володарює цілим світом. «Чи то наука бреше, чи то насправді сліди великого царя! – подумав він. – Але якщо цей слід залишив володар усього світу, тоді з якого дива він простує спекотного дня до маленького села?!  чому босоніж? Я маю перевірити свої передбачення!»<br><br>Простеживши, куди ведуть сліди, астролог вийшов до дерева, під яким сумирно сидів Будда. Учений наблизився до мудреця і ще дужче спантеличився. За всіма ознаками, то був цар, але його вигляд радше пасував простота злидареві. Ні в сих ні в тих, астролог звернувся до Будди:<br><br>– Будь ласка, розвій мої сумніви. П’ятнадцять років свого життя я згаяв на опанування науки віщувань. Хто ти: злиденний селянин чи величний цар, підкорювач світу?! Якщо скажеш, що ти злидар, я тут-таки викину свої дорогоцінні книжки в оцю річку, бо вони безглузді. Тож я позбавлюся їх і подамся додому з усвідомленням, що змарнував п’ятнадцять років даремно. 
		Почувши таке, Будда розплющив очі й мовив:<br><br>– Твоя розгубленість цілком зрозуміла. Проте не викидай книжок, вони кажуть правду.<br>– У чому ж твій секрет? – запитав астролог.<br><br>– У житті завжди трапляються винятки з правил. Ти не можеш передбачити мене. Та й ніхто не здатен провістити наступну мить мого життя, бо вона навіть мені не відома!</p>`
	},
	{
		title: 'Головний метал',
		html: `<p class="desc-item__text">Один дука прийшов до Будди і сказав:<br><br>– Я дуже заможний, але дітей у мене нема, а моя дружина віддала Богові душу. Тож я дуже хочу допомогти злидарям і всім, хто потребує допомоги. Тільки скажи, що я маю робити?<br><br>Почувши цю оповідь, Будда засмутився, і його щокою скотилася сльоза. Здивований такою реакцією, гість запитав:<br><br>– Чому на твоїх очах сльози? Чому ти так затужив?<br><br>– На превеликий жаль, наразі ти не зможеш нікому допомогти, – скрушно похитав головою мудрець. – Адже спершу ти маєш допомогти самому собі. Твій головний метал ще не став золотом. Ти не здатен зробити нічого милосердного, бо дієш несвідомо. А будь-яка добра справа потребує свідомого виконання.</p>`
	},
	{
		title: 'Закон карми',
		html: `<p class="desc-item__text">Гуляючи лісом, один чернець побачив мисливця, який цілився в оленя. Чернець мерщій підбіг до нього і заповзявся прохати не вбивати тварину.<br><br>– Чому я не можу його вбити? – здійняв брову молодик.<br>– Бо тоді, за законом карми, в наступному житті ти перевтілишся в оленя, – пояснив чернець.<br><br>Мисливець гмикнув, проте опустив зброю і не став стріляти. А потім, зиркнувши на співрозмовника, помітив, що той має дуже охайний, чистий одяг, приємне обличчя й гарні манери... І взагалі, чернець увесь випромінював радість, щастя і спокій.<br><br>Усвідомивши це, мисливець знагла спрямував рушницю на нього.<br><br>– Стривай, ти що робиш?! – зойкнув чернець.<br><br>– Ти сказав про закон карми. Отже, якщо я вб’ю тебе, то в наступному житті стану тобою. А ти мені вельми сподобався!</p>`
	},
	{
		title: 'Власний вибір',
		html: `<p class="desc-item__text">Одного дня до будднстського лами завітав вірянин. Він потерпав від мишей, які щоночі гризли його продукти в коморі, але не знав, що з ними робити: вбивати – гріх, адже то живі істоти, а жити з ними неможливо...<br><br>Лама дав небораці таку пораду:<br><br>– Поклади на шляху мишей до комори отруту. З’ївши її, всі шкідники разом зникнуть. Проте це вже буде не твоя провина, а їхній вибір.</p>`
	},
	{
		title: 'Сила волі',
		html: `<p class="desc-item__text">На одному з уроків Будда наказав учням дати якусь обітницю, аби випробувати власну силу волі. Перший учень заприсягнувся не спати впродовж трьох днів, другий – не говорити протягом семи днів, третій – не їсти два тижні, а четвертий – три дні не пити. Отже, кожен учень від чогось відмовився.<br><br>І от розпочалися тяжкі дні випробувань. Той учень, що дав обітницю не пити, першого дня почувався пречудово, ба навіть легко видерся на гору, де відбувалося навчання. Другого дня йому стало зле, і він заледве дошкандибав до вершечка гори. А вже третього дня горопаха падав із ніг і божеволів від спраги. Саме тоді, коли він мало не зомлів, на шляху йому трапився струмок. Почувши спокусливий плескіт, учень нахилився, зачерпнув долонею чисту, прохолодну воду і вже підніс був її до вуст – аж тут згадав про обітницю. Виливши воду, він знайшов Будду і з утіхою розповів, що спромігся не порушити обіцянки. Проте Будда тужливо звів на нього очі й відказав:<br><br>– Так, ти гідно витримав випробування і переміг. Але через це ти втратив найцінніше – свободу!</p>`
	},
	{
		title: 'Гріх стосовно тіла',
		html: `<p class="desc-item__text">Якось Будда разом із другом крокував сільською дорогою. Супутники жваво теревенили, аж раптом на шию Будді всілася муха. Рвучко змахнувши рукою, Будда відігнав муху, а коли вона вже полетіла геть, знагла зупинився і сказав:<br><br>– Я скоїв серйозну помилку!<br>Потому він вдруге змахнув рукою так, ніби відганяв муху. Друг не витримав і поцікавився:<br><br>– Що ти робиш? Адже мухи вже немає!<br><br>– Тепер я відганяю муху так, як годиться, – відповів Будда. – Бо я цілком усвідомлюю, що роблю. Тобто, здіймаючи руку, я розумію, що моя рука рухається вгору, до шиї, аби відігнати набридливу комаху. Минулого ж разу я надто захопився бесідою, тому мій рух вийшов безтямним. Я вчинив гріх щодо свого тіла.</p>`
	},
	{
		title: 'Пліт',
		html: `<p class="desc-item__text">Одного разу великий Будда мовив своїм послідовникам:<br><br>– От уявіть собі мандрівника, на шляху якого трапився широкий і бурхливий потік. З одного боку на нього чекає небезпека та загибель, а з іншого – спокійний, безпечний берег. Проте ані човна, ані мосту, щоби дістатися протилежного берега, поблизу немає. І от, припустімо, мандрівник вирішив спорудити пліт. Нарубав дров, скріпив їх поміж собою, а затим спустив пліт на воду і вдало перетнув потік. Але, зійшовши на берег, він раптом подумав: «Цей пліт дуже добре прислужився мені! То візьму його на плечі й продовжу мандри разом із ним!» Як гадаєте, правильно він зробив чи ні? Хіба було б не ліпше, якби той чолов’яга сказав собі: «Пліт став мені у пригоді, проте я залишу його тут і піду далі без нічого!» Так само слід учинити з моєю наукою. Бо вона є лише засобом для досягнення свободи і аж ніяк не довічною ношею.</p>`
	},
	{
		title: 'Зробити крок уперед',
		html: `<p class="desc-item__text">Якось Будда дізнався про те, що один мудрець досяг просвітлення, і подався навідати його. Поштиво уклонившись, Будда торкнувся чолом ніг мудреця – а коли випростався, то з подивом побачив, що просвітлений також віддав йому уклін.<br><br>– Що ти робиш?! – скрикнув Будда. – Те, що я схиляюся перед тобою, цілком слушно, але ж ти не маєш уклонятися мені!<br>– Станеться величезна помилка, якщо ти торкнешся моїх ніг, а я твоїх – ні, – тихо мовив мудрець. – Схилившись перед тобою, я лише підкреслюю, що ти вчинив правильно, коли поклав уклін переді мною. Але не думай, що ми дві різні людини. Насправді я – твоя часточка, яка трішечки випередила тебе. Тож не варто вважати, що я – мудрий, а ти – невіглас. Це всього-навсього питання часу. Невдовзі ти також досягнеш просвітлення. Адже, коли права нога ступає вперед, ліва завше наздоганяє її. Загалом, вона лишається позаду виключно для того, щоби права нога мала змогу зробити перший крок.</p>`
	},
	{
		title: 'У пошуках тиші',
		html: `<p class="desc-item__text">Жив собі на світі чоловік, який повсякчас прагнув розвитку та пізнання. І ось одного дня він вирішив, що для досягнення мети йому потрібна медитація. Одначе варто було йому розпочати медитувати, як одразу щось ставало на заваді.<br><br>Спершу чоловік розмістився у власному будинку. Проте не встиг він зробити бодай один глибокий вдих, як почув, що сперечаються сусіди. Чолов’яга спробував був відмежуватися від навколишніх звуків і не зважати на них, та зась! Нічого не вийшло.<br>Тоді горопаха пішов до лісу. Розташувавшись на затишній галявині, він заплющив очі – і тут-таки почув скажений дитячий вереск. Роздратований, чоловік зірвався з місця і подався на луки. Але й на луках не зазнав він спокою. Там пташка тьохнула, тут травичка зашурхотіла, а потім і вітер дмухнув... Отже, вкотре спіймавши облизня, неборака подерся на скелю. Надибавши темну печерку, він заліз усередину, всівся і... почув, як у глибині крапає вода.<br><br>Тоді чоловік вирішив спорудити будинок, захищений від будь-яких звуків, – щоби спокійно медитувати там, коли заманеться. За кілька років хатина була готова. Сповнений сподіванок, чолов’яга сів на долівку, склепив повіки... та зненацька почув цокотіння годинника! Розлючений, горопаха схопив того годинника і спересердя розтрощив об стіну. Потому він знову сів, знов заплющив очі, вдихнув, полегшено посміхнувся, налаштовуючись на тривалу медитацію... І тут у повній тиші до нього долинув стукіт власного серця!<br><br>Тієї миті чоловік усвідомив, що лиш тоді, коли тиша та спокій запанують у душі, навколо настане гармонія.</p>`
	},
	{
		title: 'Газети',
		html: `<p class="desc-item__text">Одного ранку гірською стежиною їхав на возі газетяр. А назустріч йому простували двоє монахів: майстер та його учень. Несподівано учень запитав:<br><br>– Шановний майстре! Учення наголошує, що весь світ – це сон Будди. Тож, якщо стати Буддою, цілий світ стане твоїм сном. То поясни мені, як може бути в одному світі водночас кілька пробуджених?<br><br>Цієї миті вітер сильно дмухнув угору, і газети, злетівши з воза, закружляли в повітрі.<br><br>– Дивися, – мовив майстер, – газет багацько, чи не так? Сила-силенна! А проте зміст у них однаковісінький.</p>`
	},
	{
		title: 'Коло брами до Раю',
		html: `<p class="desc-item__text">Настала та мить, коли Будда опинився коло брами до Раю. Заради цієї світлої мети він наполегливо працював усе життя. І от брама відчинилася, залунала музика, розпочалося пишне свято. Усе довкола раділо й тішилося з того, що проста людина піднеслася на таку височінь. Тієї ж таки миті до Будди вийшли вартові й загукали навперейми:<br><br>– Нарешті ти прибув! Заходь мерщій! Ми щиро вітаємо тебе!<br><br>Проте, на їхній подив, Будда мав не надто веселий вигляд. Він не міг думати про власні вигоди, бо раптом замислився про мільйони стражденних душ, які заламують руки в розпуці й мовчки благають його про допомогу!<br><br>Тож він сказав вартовим:<br>– Будь ласка, зачиніть цю чудову браму! Наразі я не можу сюди ввійти. Адже я бачу силу-силенну сумних облич. Я відчуваю серця, сповнені горя та сліз. Я чую людей, яким не довелося скуштувати ані краплини радощів. Тому я чекатиму, доки всі вони пройдуть крізь оцю браму. Можливо, очікування забере цілу вічність, однак це не має значення. Зачиніть браму, і хутчіше! Я ввійду останнім.</p>`
	},
	{
		title: 'Не зважай!',
		html: `<p class="desc-item__text">Один із учнів запитав учителя Будду:<br><br>– Скажи-но, якщо мене хтось стусоне, як мені поводитися? Що робити?<br><br>– А якщо на твою голову з дерева впаде суха гілка, як ти учиниш? – запитав навзаєм Будда.<br><br>– Але ж це лише випадковість! – заперечив учень. – Якби з дерева впала суха гілка саме тоді, коли я опинився попід його кроною, то був би звичайний збіг обставин. Тут нічого не вдієш.<br><br>Але Будда похитав головою:<br><br>– Як гілка падає з дерева, так само хтось утрачає самовладання і з опалу штурхає тебе. Не зважай на це! Простуй далі власним шляхом, ніби нічого й не трапилося.</p>`
	},
	{
		title: 'Візьми назад',
		html: `<p class="desc-item__text">Якось Будда гуртом зі своїми учнями йшов селом, де мешкали супротивники буддизму. Побачивши їх, люди повиходили зі своїх хатин, оточили вчителя та його послідовників і заповзялися вигукувати лихі слова. Учні вже почали були боронитися, коли Будда повернувся до них і промовив із докором:<br><br>– Гей, чом ви сердитеся? Нащо дозволили цим людям керувати вами і впливати на вашу поведінку? Подивіться на себе, наразі ви залежите від них! Але ж ви вільні!<br><br>Селяни аж ніяк не очікували такої реакції, тому миттєво знітились і принишкли. А Будда тим часом звернувся до них:<br><br>– Я би хотів поставити питання, що стосується всіх вас. Мешканці сусіднього села прийняли нас дуже гостинно, ба навіть принесли квіти, фрукти та ласощі. Але я сказав їм, мовляв, вибачайте, ми вже поснідали, тож віднесіть фрукти та решту частування своїм діткам. Ми не можемо прийняти ваші дари, бо ніколи не носимо із собою їжу. Так от, тепер я питаю вас, що вони мають зробити з тими смаколиками, які приготували для нас?<br><br>На це хтось із натовпу вигукнув:<br><br>– Гадаю, вони віднесуть усе додому, а потім роздадуть своїм малюкам!<br><br>– Ваша правда, – посміхнувся Будда. – А що тоді ви зробите зі своїми образами та прокляттями? Я не приймаю їх. Тож і ви несіть їх додому й робіть із ними все, що заманеться.</p>`
	},
];

const questionBtn = document.querySelector('.main__btn');
const descTitle = document.querySelector('.desc__title');
const descContainer = document.querySelector('.desc');
const textContainer = document.querySelector('.desc__item');
const btnTop = document.querySelector('.desc__btn-top');




function addText() {

	let randomIndex = Math.floor(Math.random() * parablesArray.length);

	if (window.getComputedStyle(descContainer).display === 'none') {
		descContainer.style.display = 'grid';

		descTitle.textContent = parablesArray[randomIndex].title;
		textContainer.insertAdjacentHTML('afterbegin', parablesArray[randomIndex].html)
	} else {
		descTitle.textContent = '';
		textContainer.innerHTML = '';

		descTitle.textContent = parablesArray[randomIndex].title;
		textContainer.insertAdjacentHTML('afterbegin', parablesArray[randomIndex].html)
	}

}

questionBtn.addEventListener('click', () => {
	addText();

	window.scrollTo({
		top: document.documentElement.clientHeight,
		left: 0,
		behavior: "smooth"
	});

})

btnTop.addEventListener('click', () => {
	console.log('y');
	window.scrollTo({
		top: 0,
		left: 0,
		behavior: "smooth"
	});
})
